; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v7 ?v4)
             (pred_2 ?v5 ?v3)
             (pred_8 ?v7 ?v3)
             (pred_11 ?v10 ?v7 )
	     (pred_10 ?v7)
             (pred_7 ?v6)
             (pred_6 ?v5)
             (pred_1 ?v3)
             (pred_5 ?v7)
             (pred_12 ?v5)
             (pred_4 ?v7)
             (pred_3 ))



(:action op_1
:parameters (?v1 ?v12 ?v2 ?v13)
:precondition (and (pred_7 ?v1) (pred_7 ?v12) (pred_6 ?v2) (pred_1 ?v13)
          (pred_9 ?v1 ?v12) (pred_2 ?v2 ?v13)
                   (pred_8 ?v12 ?v13) (pred_10 ?v1) 
                   (pred_5 ?v12) (pred_12 ?v2))
:effect (and  (pred_4 ?v12) (not (pred_5 ?v12))))


(:action op_3
:parameters (?v1 ?v9)
:precondition (and (pred_7 ?v1) (pred_7 ?v9)
               (pred_10 ?v1) (pred_9 ?v1 ?v9) (pred_4 ?v9))
:effect (and (pred_10 ?v9) (not (pred_10 ?v1))))

(:action op_4
:parameters (?v1 ?v2)
:precondition (and (pred_7 ?v1) (pred_6 ?v2) 
                  (pred_10 ?v1) (pred_11 ?v2 ?v1) (pred_3 ))
:effect (and (pred_12 ?v2)
   (not (pred_11 ?v2 ?v1)) (not (pred_3 ))))


(:action op_5
:parameters (?v1 ?v11 ?v8)
:precondition (and (pred_7 ?v1) (pred_6 ?v11) (pred_6 ?v8)
                  (pred_10 ?v1) (pred_12 ?v8) (pred_11 ?v11 ?v1))
:effect (and (pred_12 ?v11) (pred_11 ?v8 ?v1)
        (not (pred_12 ?v8)) (not (pred_11 ?v11 ?v1))))

(:action op_2
:parameters (?v1 ?v2)
:precondition (and (pred_7 ?v1) (pred_6 ?v2) 
                  (pred_10 ?v1) (pred_12 ?v2))
:effect (and (pred_3 ) (pred_11 ?v2 ?v1) (not (pred_12 ?v2)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_11 obj_25 obj_19 obj_01 obj_12 obj_02 obj_18 obj_10 obj_16 obj_26 obj_22 obj_04 obj_05 obj_08 obj_14 obj_28 obj_21 obj_20 obj_15 obj_30 obj_29 obj_24 obj_27 obj_31 obj_23
    obj_07 obj_09 obj_13
    obj_03 obj_17 obj_06
    )

    (:init
       (pred_3)

       (pred_7 obj_11)
       (pred_7 obj_25)
       (pred_7 obj_19)
       (pred_7 obj_01)
       (pred_7 obj_12)
       (pred_7 obj_02)
       (pred_7 obj_18)
       (pred_7 obj_10)
       (pred_7 obj_16)
       (pred_7 obj_26)
       (pred_7 obj_22)
       (pred_7 obj_04)
       (pred_7 obj_05)
       (pred_7 obj_08)
       (pred_7 obj_14)
       (pred_7 obj_28)
       (pred_7 obj_21)
       (pred_7 obj_20)
       (pred_7 obj_15)
       (pred_7 obj_30)
       (pred_7 obj_29)
       (pred_7 obj_24)
       (pred_7 obj_27)
       (pred_7 obj_31)
       (pred_7 obj_23)
       (pred_1 obj_07)
       (pred_1 obj_09)
       (pred_1 obj_13)
       (pred_6 obj_03)
       (pred_6 obj_17)
       (pred_6 obj_06)

       (pred_9 obj_11 obj_02)
       (pred_9 obj_11 obj_25)
       (pred_9 obj_25 obj_18)
       (pred_9 obj_25 obj_19)
       (pred_9 obj_25 obj_11)
       (pred_9 obj_19 obj_10)
       (pred_9 obj_19 obj_01)
       (pred_9 obj_19 obj_25)
       (pred_9 obj_01 obj_16)
       (pred_9 obj_01 obj_12)
       (pred_9 obj_01 obj_19)
       (pred_9 obj_12 obj_26)
       (pred_9 obj_12 obj_01)
       (pred_9 obj_02 obj_22)
       (pred_9 obj_02 obj_18)
       (pred_9 obj_02 obj_11)
       (pred_9 obj_18 obj_04)
       (pred_9 obj_18 obj_10)
       (pred_9 obj_18 obj_25)
       (pred_9 obj_18 obj_02)
       (pred_9 obj_10 obj_05)
       (pred_9 obj_10 obj_16)
       (pred_9 obj_10 obj_19)
       (pred_9 obj_10 obj_18)
       (pred_9 obj_16 obj_08)
       (pred_9 obj_16 obj_26)
       (pred_9 obj_16 obj_01)
       (pred_9 obj_16 obj_10)
       (pred_9 obj_26 obj_14)
       (pred_9 obj_26 obj_12)
       (pred_9 obj_26 obj_16)
       (pred_9 obj_22 obj_28)
       (pred_9 obj_22 obj_04)
       (pred_9 obj_22 obj_02)
       (pred_9 obj_04 obj_21)
       (pred_9 obj_04 obj_05)
       (pred_9 obj_04 obj_18)
       (pred_9 obj_04 obj_22)
       (pred_9 obj_05 obj_20)
       (pred_9 obj_05 obj_08)
       (pred_9 obj_05 obj_10)
       (pred_9 obj_05 obj_04)
       (pred_9 obj_08 obj_15)
       (pred_9 obj_08 obj_14)
       (pred_9 obj_08 obj_16)
       (pred_9 obj_08 obj_05)
       (pred_9 obj_14 obj_30)
       (pred_9 obj_14 obj_26)
       (pred_9 obj_14 obj_08)
       (pred_9 obj_28 obj_29)
       (pred_9 obj_28 obj_21)
       (pred_9 obj_28 obj_22)
       (pred_9 obj_21 obj_24)
       (pred_9 obj_21 obj_20)
       (pred_9 obj_21 obj_04)
       (pred_9 obj_21 obj_28)
       (pred_9 obj_20 obj_27)
       (pred_9 obj_20 obj_15)
       (pred_9 obj_20 obj_05)
       (pred_9 obj_20 obj_21)
       (pred_9 obj_15 obj_31)
       (pred_9 obj_15 obj_30)
       (pred_9 obj_15 obj_08)
       (pred_9 obj_15 obj_20)
       (pred_9 obj_30 obj_23)
       (pred_9 obj_30 obj_14)
       (pred_9 obj_30 obj_15)
       (pred_9 obj_29 obj_24)
       (pred_9 obj_29 obj_28)
       (pred_9 obj_24 obj_27)
       (pred_9 obj_24 obj_21)
       (pred_9 obj_24 obj_29)
       (pred_9 obj_27 obj_31)
       (pred_9 obj_27 obj_20)
       (pred_9 obj_27 obj_24)
       (pred_9 obj_31 obj_23)
       (pred_9 obj_31 obj_15)
       (pred_9 obj_31 obj_27)
       (pred_9 obj_23 obj_30)
       (pred_9 obj_23 obj_31)
       (pred_5 obj_22)
       (pred_5 obj_29)
       (pred_5 obj_01)
       (pred_8  obj_22 obj_07)
       (pred_8  obj_29 obj_09)
       (pred_8  obj_01 obj_13)
       (pred_4 obj_11)
       (pred_4 obj_25)
       (pred_4 obj_19)
       (pred_4 obj_12)
       (pred_4 obj_02)
       (pred_4 obj_18)
       (pred_4 obj_10)
       (pred_4 obj_16)
       (pred_4 obj_26)
       (pred_4 obj_04)
       (pred_4 obj_05)
       (pred_4 obj_08)
       (pred_4 obj_14)
       (pred_4 obj_28)
       (pred_4 obj_21)
       (pred_4 obj_20)
       (pred_4 obj_15)
       (pred_4 obj_30)
       (pred_4 obj_24)
       (pred_4 obj_27)
       (pred_4 obj_31)
       (pred_4 obj_23)

       (pred_2  obj_03 obj_07)
       (pred_2  obj_17 obj_09)
       (pred_2  obj_06 obj_13)
       (pred_11 obj_03 obj_26)
       (pred_11 obj_17 obj_19)
       (pred_11 obj_06 obj_10)
       (pred_10 obj_16)
    )

    (:goal (and
       (pred_11 obj_17 obj_18)
       (pred_11 obj_06 obj_24)
    ))
(:constraints
  (always (not (pred_10 obj_25)))
)
)

; plan
1. (op_3 obj_16 obj_10)
   deleted: (pred_10 obj_16)
   added: (pred_10 obj_10)
   goals met: 0 of 2
2. (op_4 obj_10 obj_06)
   deleted: (pred_11 obj_06 obj_10) (pred_3)
   added: (pred_12 obj_06)
   goals met: 0 of 2
3. (op_3 obj_10 obj_19)
   deleted: (pred_10 obj_10)
   added: (pred_10 obj_19)
   goals met: 0 of 2
4. (op_5 obj_19 obj_17 obj_06)
   deleted: (pred_12 obj_06) (pred_11 obj_17 obj_19)
   added: (pred_12 obj_17) (pred_11 obj_06 obj_19)
   goals met: 0 of 2
5. (op_3 obj_19 obj_10)
   deleted: (pred_10 obj_19)
   added: (pred_10 obj_10)
   goals met: 0 of 2
6. (op_3 obj_10 obj_18)
   deleted: (pred_10 obj_10)
   added: (pred_10 obj_18)
   goals met: 0 of 2
7. (op_2 obj_18 obj_17)
   deleted: (pred_12 obj_17)
   added: (pred_3) (pred_11 obj_17 obj_18)
   goals met: 1 of 2
8. (op_3 obj_18 obj_10)
   deleted: (pred_10 obj_18)
   added: (pred_10 obj_10)
   goals met: 1 of 2
9. (op_3 obj_10 obj_19)
   deleted: (pred_10 obj_10)
   added: (pred_10 obj_19)
   goals met: 1 of 2
10. (op_4 obj_19 obj_06)
   deleted: (pred_11 obj_06 obj_19) (pred_3)
   added: (pred_12 obj_06)
   goals met: 1 of 2
11. (op_3 obj_19 obj_10)
   deleted: (pred_10 obj_19)
   added: (pred_10 obj_10)
   goals met: 1 of 2
12. (op_3 obj_10 obj_18)
   deleted: (pred_10 obj_10)
   added: (pred_10 obj_18)
   goals met: 1 of 2
13. (op_3 obj_18 obj_04)
   deleted: (pred_10 obj_18)
   added: (pred_10 obj_04)
   goals met: 1 of 2
14. (op_3 obj_04 obj_21)
   deleted: (pred_10 obj_04)
   added: (pred_10 obj_21)
   goals met: 1 of 2
15. (op_3 obj_21 obj_24)
   deleted: (pred_10 obj_21)
   added: (pred_10 obj_24)
   goals met: 1 of 2
16. (op_2 obj_24 obj_06)
   deleted: (pred_12 obj_06)
   added: (pred_3) (pred_11 obj_06 obj_24)
   goals met: 2 of 2
